InformationRegisters/СистемаВзаимодейтсвияСоответствиеОбсуждений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СистемаВзаимодейтсвияСоответствиеОбсуждений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОбсуждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбсуждений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СистемаВзаимодействияПривилегированный/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// <Система взаимодействия: функции и процедуры для работы с сервером взаимодействия.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// ТекстСообщения - Строка - содержит электронные адреса, разделенные запятой. Например, "support@mycorp.ru, v8@localdomain".
// Получатели - Массив ИЛИ СправочникСсылка.Пользователи – пользователь, которому адресовано сообщение. Если пользователь не указан, 
//                                                то сообщение будет отправлено всем пользователям.
// ВидОбсуждения - ПеречислениеСсылка.ВидыОбсуждений – вид обсуждения. Имя вида соответсвует имени темы обсуждения.
//                                                Если вид обсуждения не указан, сообщение будет отправлено в скрытое обсуждение.
Процедура ОтправитьСообщение(ТекстСообщения, Получатели = Неопределено, ВидОбсуждения = Неопределено) Экспорт
	
	//Проверим, что база рарегистрирована в системе взаимодействия.
	Если Не СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		Возврат;
	КонецЕсли;
	
	//Определим пользователей получателей.
	Если ТипЗнч(Получатели) = Тип("СправочникСсылка.Пользователи") И ЗначениеЗаполнено(Получатели) Тогда
		ПользователиПолучателей = Новый Массив();
		ПользователиПолучателей.Добавить(Получатели);
	ИначеЕсли ТипЗнч(Получатели) = Тип("Массив") Тогда
		ПользователиПолучателей = Получатели;
	Иначе
		ПользователиПолучателей = ПолучитьАктуальныхПользователей();
	КонецЕсли;
	
	//Получим список обсуждений и добавим в них недостающих пользователей.
	СоответствиеПользователей = ПолучитьСоответствиеПользователей(ПользователиПолучателей);
	СписокУникальныхОбсуждений = Новый Соответствие;
	
	Для Каждого Пользователь Из СоответствиеПользователей Цикл
		
		ИдентификаторОбсужденияСтрока = ПолучитьИдентификаторОбсуждения(Пользователь.Ключ, ВидОбсуждения);
		ИдентификаторОбсуждения = Новый ИдентификаторОбсужденияСистемыВзаимодействия(ИдентификаторОбсужденияСтрока);
		
		Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(ИдентификаторОбсуждения);
		
		Если Не Обсуждение.Участники.Содержит(Пользователь.Значение) Тогда
			Обсуждение.Участники.Добавить(Пользователь.Значение);
		КонецЕсли;
		
		Обсуждение.Записать();
		
		СписокУникальныхОбсуждений.Вставить(ИдентификаторОбсуждения);
		
	КонецЦикла;
	
	//Отправим сообщение по неконтекстным обсуждениям.
	Для Каждого ИдентификаторОбсуждения Из СписокУникальныхОбсуждений Цикл
		СоздатьСообщение(ИдентификаторОбсуждения.Ключ, ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьИдентификаторОбсуждения(Пользователь = Неопределено, ВидОбсуждения = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.СистемаВзаимодейтсвияСоответствиеОбсуждений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидОбсуждения.Установить(?(ЗначениеЗаполнено(ВидОбсуждения), ВидОбсуждения, Перечисления.ВидыОбсуждений.ПустаяСсылка()));
	НаборЗаписей.Отбор.Пользователь.Установить(?(ЗначениеЗаполнено(Пользователь), Пользователь, Справочники.Пользователи.ПустаяСсылка()));
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		ИдентификаторОбсужденияСтрока = Строка(СоздатьОбсуждениеБезКонтекста(Пользователь, ВидОбсуждения));
	Иначе
		Для Каждого Запись Из НаборЗаписей Цикл
			ИдентификаторОбсужденияСтрока = Запись.ИдентификаторОбсуждения;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИдентификаторОбсужденияСтрока;
	
КонецФункции

Функция СоздатьОбсуждениеБезКонтекста(Пользователь = Неопределено, ВидОбсуждения = Неопределено) Экспорт
	
	НовоеОбсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
	НовоеОбсуждение.Отображаемое = ?(ЗначениеЗаполнено(ВидОбсуждения) И ЗначениеЗаполнено(Пользователь), Истина, Ложь);
	НовоеОбсуждение.Ключ = Строка(Новый УникальныйИдентификатор);
	Если ЗначениеЗаполнено(ВидОбсуждения) Тогда
		НовоеОбсуждение.Заголовок = Строка(ВидОбсуждения);
	КонецЕсли;
	НовоеОбсуждение.Записать();
	
	НаборЗаписей = РегистрыСведений.СистемаВзаимодейтсвияСоответствиеОбсуждений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидОбсуждения.Установить(?(ЗначениеЗаполнено(ВидОбсуждения), ВидОбсуждения, Перечисления.ВидыОбсуждений.ПустаяСсылка()));
	НаборЗаписей.Отбор.Пользователь.Установить(?(ЗначениеЗаполнено(Пользователь), Пользователь, Справочники.Пользователи.ПустаяСсылка()));
	
	Запись = НаборЗаписей.Добавить();
	Запись.ВидОбсуждения = ?(ЗначениеЗаполнено(ВидОбсуждения), ВидОбсуждения, Перечисления.ВидыОбсуждений.ПустаяСсылка());
	Запись.Пользователь = ?(ЗначениеЗаполнено(Пользователь), Пользователь, Справочники.Пользователи.ПустаяСсылка());
	Запись.ИдентификаторОбсуждения = НовоеОбсуждение.Идентификатор;
	
	НаборЗаписей.Записать();
	
	Возврат НовоеОбсуждение.Идентификатор;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьСообщение(ИдентификаторОбсуждения, ТекстСообщения)
	
	НовоеСообщение = СистемаВзаимодействия.СоздатьСообщение(ИдентификаторОбсуждения);
	НовоеСообщение.Дата = ТекущаяДата();
	НовоеСообщение.Текст = ТекстСообщения;
	НовоеСообщение.Записать();
	
КонецПроцедуры

Функция ПолучитьАктуальныхПользователей()
	
	Результат = Новый Массив;
	
	Выборка = Справочники.Пользователи.Выбрать( ,, Новый Структура("Недействителен", Ложь));
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеПользователей(Пользователи)
	
	Результат = Новый Соответствие;
	
	Для Каждого Пользователь Из Пользователи Цикл
		//ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Пользователь);
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь.ИдентификаторПользователяИБ);
		Если ПользовательИБ <> Неопределено Тогда
			Попытка
				ИдентификаторПользователяСВ = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ПользовательИБ.УникальныйИдентификатор);
			Исключение
				ПользовательСВ = СистемаВзаимодействия.СоздатьПользователя(ПользовательИБ);
				ПользовательСВ.Записать();
				ИдентификаторПользователяСВ = ПользовательСВ.Идентификатор;
			КонецПопытки;
			Результат.Вставить(Пользователь, ИдентификаторПользователяСВ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
